In [1]:
import pandas as pd

In [ ]:
#Load the CSV file using pandas.
df=pd.read_csv('sales2.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmpID       50 non-null     int64
 1   Name        50 non-null     object
 2   Age         50 non-null     int64
 3   Department  50 non-null     object
 4   Salary      50 non-null     int64
 5   Experience  50 non-null     int64
 6   City        50 non-null     object
dtypes: int64(4), object(3)
memory usage: 2.9+ KB

In [5]:
df.sample()

   EmpID   Name  Age Department  Salary  Experience   City
8      9  Meena   31      Sales   42000           7  Erode

In [6]:
#Display first 5 rows.
df.head()

   EmpID    Name  Age Department  Salary  Experience        City
0      1    Ravi   25         IT   30000           2     Chennai
1      2  Karthi   28         HR   28000           3  Coimbatore
2      3     Anu   24    Finance   32000           1     Chennai
3      4    Mani   30         IT   45000           6   Bangalore
4      5   Priya   27      Sales   35000           4     Madurai

In [7]:
#Display last 10 rows.
df.tail(10)

    EmpID        Name  Age Department  Salary  Experience        City
40     41      Vinoth   35         IT   58000          11   Bangalore
41     42      Chitra   29    Finance   41000           5      Trichy
42     43       Manoj   33      Sales   49000           8     Chennai
43     44      Sindhu   24         HR   26000           1  Coimbatore
44     45     Aravind   37         IT   62000          14   Bangalore
45     46     Preethi   28    Finance   38000           4     Madurai
46     47  Muthukumar   34      Sales   52000           9       Salem
47     48     Shalini   27         HR   35000           3       Erode
48     49       Surya   31         IT   46000           6      Trichy
49     50      Bhavya   25    Finance   33000           2     Chennai

In [8]:
#Find total number of rows and columns.
df.shape

(50, 7)

In [11]:
#Show column names.
df.columns

Index(['EmpID', 'Name', 'Age', 'Department', 'Salary', 'Experience', 'City'], dtype='object')

In [12]:
#Get all employees from IT department.
df[df["Department"]=="IT"]

    EmpID     Name  Age Department  Salary  Experience        City
0       1     Ravi   25         IT   30000           2     Chennai
3       4     Mani   30         IT   45000           6   Bangalore
6       7    Divya   26         IT   33000           2       Salem
9      10    Vijay   34         IT   55000           9   Bangalore
13     14    Kumar   32         IT   48000           7       Salem
16     17  Keerthi   24         IT   31000           1       Erode
20     21   Deepak   28         IT   39000           4  Coimbatore
24     25    Gokul   35         IT   60000          12   Bangalore
28     29   Ramesh   38         IT   65000          15   Bangalore
32     33   Naveen   30         IT   44000           6      Trichy
36     37  Kishore   31         IT   47000           7  Coimbatore
40     41   Vinoth   35         IT   58000          11   Bangalore
44     45  Aravind   37         IT   62000          14   Bangalore
48     49    Surya   31         IT   46000           6      Trichy

In [13]:
#Employees whose salary > 40000.
df[df["Salary"]>40000]

    EmpID        Name  Age Department  Salary  Experience        City
3       4        Mani   30         IT   45000           6   Bangalore
5       6      Suresh   35         HR   50000          10      Trichy
8       9       Meena   31      Sales   42000           7       Erode
9      10       Vijay   34         IT   55000           9   Bangalore
13     14       Kumar   32         IT   48000           7       Salem
15     16       Mohan   33      Sales   46000           8     Chennai
17     18    Santhosh   36    Finance   52000          11   Bangalore
19     20        Bala   31         HR   43000           6     Chennai
21     22     Revathi   34    Finance   50000           9     Madurai
22     23       Ajith   29      Sales   41000           5      Trichy
24     25       Gokul   35         IT   60000          12   Bangalore
26     27     Prakash   32      Sales   47000           7       Salem
28     29      Ramesh   38         IT   65000          15   Bangalore
30     31   Saravanan   33      Sales   48000           8     Chennai
32     33      Naveen   30         IT   44000           6      Trichy
33     34      Monica   29    Finance   42000           5       Salem
34     35       Sekar   36      Sales   53000          10   Bangalore
36     37     Kishore   31         IT   47000           7  Coimbatore
37     38       Radha   34    Finance   51000           9     Madurai
40     41      Vinoth   35         IT   58000          11   Bangalore
41     42      Chitra   29    Finance   41000           5      Trichy
42     43       Manoj   33      Sales   49000           8     Chennai
44     45     Aravind   37         IT   62000          14   Bangalore
46     47  Muthukumar   34      Sales   52000           9       Salem
48     49       Surya   31         IT   46000           6      Trichy

In [14]:
#Employees from Chennai.
df[df["City"]=="Chennai"]

    EmpID       Name  Age Department  Salary  Experience     City
0       1       Ravi   25         IT   30000           2  Chennai
2       3        Anu   24    Finance   32000           1  Chennai
7       8       Arun   29    Finance   40000           5  Chennai
10     11      Nisha   23         HR   25000           1  Chennai
15     16      Mohan   33      Sales   46000           8  Chennai
19     20       Bala   31         HR   43000           6  Chennai
25     26     Harini   26    Finance   35000           2  Chennai
30     31  Saravanan   33      Sales   48000           8  Chennai
35     36        Uma   25         HR   30000           2  Chennai
42     43      Manoj   33      Sales   49000           8  Chennai
49     50     Bhavya   25    Finance   33000           2  Chennai

In [15]:
#Employees with experience >= 5 years.
df[df["Experience"]>=5]

    EmpID        Name  Age Department  Salary  Experience        City
3       4        Mani   30         IT   45000           6   Bangalore
5       6      Suresh   35         HR   50000          10      Trichy
7       8        Arun   29    Finance   40000           5     Chennai
8       9       Meena   31      Sales   42000           7       Erode
9      10       Vijay   34         IT   55000           9   Bangalore
13     14       Kumar   32         IT   48000           7       Salem
14     15       Latha   29         HR   36000           5      Trichy
15     16       Mohan   33      Sales   46000           8     Chennai
17     18    Santhosh   36    Finance   52000          11   Bangalore
19     20        Bala   31         HR   43000           6     Chennai
21     22     Revathi   34    Finance   50000           9     Madurai
22     23       Ajith   29      Sales   41000           5      Trichy
24     25       Gokul   35         IT   60000          12   Bangalore
26     27     Prakash   32      Sales   47000           7       Salem
28     29      Ramesh   38         IT   65000          15   Bangalore
30     31   Saravanan   33      Sales   48000           8     Chennai
32     33      Naveen   30         IT   44000           6      Trichy
33     34      Monica   29    Finance   42000           5       Salem
34     35       Sekar   36      Sales   53000          10   Bangalore
36     37     Kishore   31         IT   47000           7  Coimbatore
37     38       Radha   34    Finance   51000           9     Madurai
40     41      Vinoth   35         IT   58000          11   Bangalore
41     42      Chitra   29    Finance   41000           5      Trichy
42     43       Manoj   33      Sales   49000           8     Chennai
44     45     Aravind   37         IT   62000          14   Bangalore
46     47  Muthukumar   34      Sales   52000           9       Salem
48     49       Surya   31         IT   46000           6      Trichy

In [ ]:
#HR employees with salary < 35000.
df[(df["Department"]=="HR") & (df["Salary"]<35000)]

    EmpID      Name  Age Department  Salary  Experience        City
1       2    Karthi   28         HR   28000           3  Coimbatore
10     11     Nisha   23         HR   25000           1     Chennai
23     24     Sneha   25         HR   29000           2       Erode
27     28    Swetha   24         HR   27000           1  Coimbatore
31     32    Janani   27         HR   34000           3       Erode
35     36       Uma   25         HR   30000           2     Chennai
39     40  Pavithra   26         HR   32000           3       Salem
43     44    Sindhu   24         HR   26000           1  Coimbatore

In [20]:
#Find average salary.
df["Salary"].mean()

np.float64(41440.0)

In [21]:
#Find maximum salary.
df[["Salary"]].max()

Salary    65000
dtype: int64

In [65]:
#Find minimum age.
df[["Age"]].min()

Age    23
dtype: int64

In [25]:
#Average salary by department.
df.groupby("Department")["Salary"].mean().reset_index()

  Department        Salary
0    Finance  40583.333333
1         HR  32916.666667
2         IT  47357.142857
3      Sales  43916.666667

In [27]:
#Count employees in each city.
df.groupby("City")["EmpID"].count().reset_index()

         City  EmpID
0   Bangalore      8
1     Chennai     11
2  Coimbatore      6
3       Erode      6
4     Madurai      6
5       Salem      7
6      Trichy      6

In [ ]:
#Sort by salary (ascending).
df.sort_values("Salary",ascending=True)

    EmpID        Name  Age Department  Salary  Experience        City
10     11       Nisha   23         HR   25000           1     Chennai
43     44      Sindhu   24         HR   26000           1  Coimbatore
27     28      Swetha   24         HR   27000           1  Coimbatore
1       2      Karthi   28         HR   28000           3  Coimbatore
23     24       Sneha   25         HR   29000           2       Erode
0       1        Ravi   25         IT   30000           2     Chennai
35     36         Uma   25         HR   30000           2     Chennai
16     17     Keerthi   24         IT   31000           1       Erode
2       3         Anu   24    Finance   32000           1     Chennai
39     40    Pavithra   26         HR   32000           3       Salem
49     50      Bhavya   25    Finance   33000           2     Chennai
6       7       Divya   26         IT   33000           2       Salem
31     32      Janani   27         HR   34000           3       Erode
12     13       Pooja   26    Finance   34000           2     Madurai
4       5       Priya   27      Sales   35000           4     Madurai
25     26      Harini   26    Finance   35000           2     Chennai
47     48     Shalini   27         HR   35000           3       Erode
14     15       Latha   29         HR   36000           5      Trichy
11     12         Raj   28      Sales   37000           4  Coimbatore
45     46     Preethi   28    Finance   38000           4     Madurai
18     19   Aishwarya   27      Sales   38000           3       Salem
38     39     Sathish   28      Sales   39000           4       Erode
20     21      Deepak   28         IT   39000           4  Coimbatore
29     30       Kavya   28    Finance   39000           4     Madurai
7       8        Arun   29    Finance   40000           5     Chennai
41     42      Chitra   29    Finance   41000           5      Trichy
22     23       Ajith   29      Sales   41000           5      Trichy
8       9       Meena   31      Sales   42000           7       Erode
33     34      Monica   29    Finance   42000           5       Salem
19     20        Bala   31         HR   43000           6     Chennai
32     33      Naveen   30         IT   44000           6      Trichy
3       4        Mani   30         IT   45000           6   Bangalore
48     49       Surya   31         IT   46000           6      Trichy
15     16       Mohan   33      Sales   46000           8     Chennai
26     27     Prakash   32      Sales   47000           7       Salem
36     37     Kishore   31         IT   47000           7  Coimbatore
30     31   Saravanan   33      Sales   48000           8     Chennai
13     14       Kumar   32         IT   48000           7       Salem
42     43       Manoj   33      Sales   49000           8     Chennai
21     22     Revathi   34    Finance   50000           9     Madurai
5       6      Suresh   35         HR   50000          10      Trichy
37     38       Radha   34    Finance   51000           9     Madurai
46     47  Muthukumar   34      Sales   52000           9       Salem
17     18    Santhosh   36    Finance   52000          11   Bangalore
34     35       Sekar   36      Sales   53000          10   Bangalore
9      10       Vijay   34         IT   55000           9   Bangalore
40     41      Vinoth   35         IT   58000          11   Bangalore
24     25       Gokul   35         IT   60000          12   Bangalore
44     45     Aravind   37         IT   62000          14   Bangalore
28     29      Ramesh   38         IT   65000          15   Bangalore

In [30]:
#Sort by age (descending).
df.sort_values("Age",ascending=False)

    EmpID        Name  Age Department  Salary  Experience        City
28     29      Ramesh   38         IT   65000          15   Bangalore
44     45     Aravind   37         IT   62000          14   Bangalore
17     18    Santhosh   36    Finance   52000          11   Bangalore
34     35       Sekar   36      Sales   53000          10   Bangalore
24     25       Gokul   35         IT   60000          12   Bangalore
40     41      Vinoth   35         IT   58000          11   Bangalore
5       6      Suresh   35         HR   50000          10      Trichy
9      10       Vijay   34         IT   55000           9   Bangalore
37     38       Radha   34    Finance   51000           9     Madurai
21     22     Revathi   34    Finance   50000           9     Madurai
46     47  Muthukumar   34      Sales   52000           9       Salem
15     16       Mohan   33      Sales   46000           8     Chennai
30     31   Saravanan   33      Sales   48000           8     Chennai
42     43       Manoj   33      Sales   49000           8     Chennai
13     14       Kumar   32         IT   48000           7       Salem
26     27     Prakash   32      Sales   47000           7       Salem
48     49       Surya   31         IT   46000           6      Trichy
8       9       Meena   31      Sales   42000           7       Erode
36     37     Kishore   31         IT   47000           7  Coimbatore
19     20        Bala   31         HR   43000           6     Chennai
32     33      Naveen   30         IT   44000           6      Trichy
3       4        Mani   30         IT   45000           6   Bangalore
41     42      Chitra   29    Finance   41000           5      Trichy
33     34      Monica   29    Finance   42000           5       Salem
7       8        Arun   29    Finance   40000           5     Chennai
22     23       Ajith   29      Sales   41000           5      Trichy
14     15       Latha   29         HR   36000           5      Trichy
1       2      Karthi   28         HR   28000           3  Coimbatore
38     39     Sathish   28      Sales   39000           4       Erode
45     46     Preethi   28    Finance   38000           4     Madurai
29     30       Kavya   28    Finance   39000           4     Madurai
20     21      Deepak   28         IT   39000           4  Coimbatore
11     12         Raj   28      Sales   37000           4  Coimbatore
4       5       Priya   27      Sales   35000           4     Madurai
47     48     Shalini   27         HR   35000           3       Erode
31     32      Janani   27         HR   34000           3       Erode
18     19   Aishwarya   27      Sales   38000           3       Salem
39     40    Pavithra   26         HR   32000           3       Salem
6       7       Divya   26         IT   33000           2       Salem
12     13       Pooja   26    Finance   34000           2     Madurai
25     26      Harini   26    Finance   35000           2     Chennai
0       1        Ravi   25         IT   30000           2     Chennai
49     50      Bhavya   25    Finance   33000           2     Chennai
35     36         Uma   25         HR   30000           2     Chennai
23     24       Sneha   25         HR   29000           2       Erode
2       3         Anu   24    Finance   32000           1     Chennai
27     28      Swetha   24         HR   27000           1  Coimbatore
16     17     Keerthi   24         IT   31000           1       Erode
43     44      Sindhu   24         HR   26000           1  Coimbatore
10     11       Nisha   23         HR   25000           1     Chennai

In [42]:
#Sort by experience then salary.
df.sort_values(by=["Experience","Salary"],ascending=[True,True])

    EmpID        Name  Age Department  Salary  Experience        City
10     11       Nisha   23         HR   25000           1     Chennai
43     44      Sindhu   24         HR   26000           1  Coimbatore
27     28      Swetha   24         HR   27000           1  Coimbatore
16     17     Keerthi   24         IT   31000           1       Erode
2       3         Anu   24    Finance   32000           1     Chennai
23     24       Sneha   25         HR   29000           2       Erode
0       1        Ravi   25         IT   30000           2     Chennai
35     36         Uma   25         HR   30000           2     Chennai
6       7       Divya   26         IT   33000           2       Salem
49     50      Bhavya   25    Finance   33000           2     Chennai
12     13       Pooja   26    Finance   34000           2     Madurai
25     26      Harini   26    Finance   35000           2     Chennai
1       2      Karthi   28         HR   28000           3  Coimbatore
39     40    Pavithra   26         HR   32000           3       Salem
31     32      Janani   27         HR   34000           3       Erode
47     48     Shalini   27         HR   35000           3       Erode
18     19   Aishwarya   27      Sales   38000           3       Salem
4       5       Priya   27      Sales   35000           4     Madurai
11     12         Raj   28      Sales   37000           4  Coimbatore
45     46     Preethi   28    Finance   38000           4     Madurai
20     21      Deepak   28         IT   39000           4  Coimbatore
29     30       Kavya   28    Finance   39000           4     Madurai
38     39     Sathish   28      Sales   39000           4       Erode
14     15       Latha   29         HR   36000           5      Trichy
7       8        Arun   29    Finance   40000           5     Chennai
22     23       Ajith   29      Sales   41000           5      Trichy
41     42      Chitra   29    Finance   41000           5      Trichy
33     34      Monica   29    Finance   42000           5       Salem
19     20        Bala   31         HR   43000           6     Chennai
32     33      Naveen   30         IT   44000           6      Trichy
3       4        Mani   30         IT   45000           6   Bangalore
48     49       Surya   31         IT   46000           6      Trichy
8       9       Meena   31      Sales   42000           7       Erode
26     27     Prakash   32      Sales   47000           7       Salem
36     37     Kishore   31         IT   47000           7  Coimbatore
13     14       Kumar   32         IT   48000           7       Salem
15     16       Mohan   33      Sales   46000           8     Chennai
30     31   Saravanan   33      Sales   48000           8     Chennai
42     43       Manoj   33      Sales   49000           8     Chennai
21     22     Revathi   34    Finance   50000           9     Madurai
37     38       Radha   34    Finance   51000           9     Madurai
46     47  Muthukumar   34      Sales   52000           9       Salem
9      10       Vijay   34         IT   55000           9   Bangalore
5       6      Suresh   35         HR   50000          10      Trichy
34     35       Sekar   36      Sales   53000          10   Bangalore
17     18    Santhosh   36    Finance   52000          11   Bangalore
40     41      Vinoth   35         IT   58000          11   Bangalore
24     25       Gokul   35         IT   60000          12   Bangalore
44     45     Aravind   37         IT   62000          14   Bangalore
28     29      Ramesh   38         IT   65000          15   Bangalore

In [44]:
#Department-wise average salary.
df.groupby("Department")["Salary"].mean().reset_index()

  Department        Salary
0    Finance  40583.333333
1         HR  32916.666667
2         IT  47357.142857
3      Sales  43916.666667

In [ ]:
#City-wise employee count.
df.groupby("City")["EmpID"].count().reset_index()

         City  EmpID
0   Bangalore      8
1     Chennai     11
2  Coimbatore      6
3       Erode      6
4     Madurai      6
5       Salem      7
6      Trichy      6

In [49]:
#Department-wise maximum experience.
df.groupby("Department")["Experience"].max().reset_index()

  Department  Experience
0    Finance          11
1         HR          10
2         IT          15
3      Sales          10

In [51]:
#Average salary of IT employees per city.
df[df["Department"]=="IT"].groupby("City")["Salary"].mean().reset_index()

         City   Salary
0   Bangalore  57500.0
1     Chennai  30000.0
2  Coimbatore  43000.0
3       Erode  31000.0
4       Salem  40500.0
5      Trichy  45000.0

In [53]:
#Add a new column Bonus = Salary * 0.10.
df["Bonus"]=df["Salary"]*0.10
df

    EmpID        Name  Age Department  Salary  Experience        City   Bonus
0       1        Ravi   25         IT   30000           2     Chennai  3000.0
1       2      Karthi   28         HR   28000           3  Coimbatore  2800.0
2       3         Anu   24    Finance   32000           1     Chennai  3200.0
3       4        Mani   30         IT   45000           6   Bangalore  4500.0
4       5       Priya   27      Sales   35000           4     Madurai  3500.0
5       6      Suresh   35         HR   50000          10      Trichy  5000.0
6       7       Divya   26         IT   33000           2       Salem  3300.0
7       8        Arun   29    Finance   40000           5     Chennai  4000.0
8       9       Meena   31      Sales   42000           7       Erode  4200.0
9      10       Vijay   34         IT   55000           9   Bangalore  5500.0
10     11       Nisha   23         HR   25000           1     Chennai  2500.0
11     12         Raj   28      Sales   37000           4  Coimbatore  3700.0
12     13       Pooja   26    Finance   34000           2     Madurai  3400.0
13     14       Kumar   32         IT   48000           7       Salem  4800.0
14     15       Latha   29         HR   36000           5      Trichy  3600.0
15     16       Mohan   33      Sales   46000           8     Chennai  4600.0
16     17     Keerthi   24         IT   31000           1       Erode  3100.0
17     18    Santhosh   36    Finance   52000          11   Bangalore  5200.0
18     19   Aishwarya   27      Sales   38000           3       Salem  3800.0
19     20        Bala   31         HR   43000           6     Chennai  4300.0
20     21      Deepak   28         IT   39000           4  Coimbatore  3900.0
21     22     Revathi   34    Finance   50000           9     Madurai  5000.0
22     23       Ajith   29      Sales   41000           5      Trichy  4100.0
23     24       Sneha   25         HR   29000           2       Erode  2900.0
24     25       Gokul   35         IT   60000          12   Bangalore  6000.0
25     26      Harini   26    Finance   35000           2     Chennai  3500.0
26     27     Prakash   32      Sales   47000           7       Salem  4700.0
27     28      Swetha   24         HR   27000           1  Coimbatore  2700.0
28     29      Ramesh   38         IT   65000          15   Bangalore  6500.0
29     30       Kavya   28    Finance   39000           4     Madurai  3900.0
30     31   Saravanan   33      Sales   48000           8     Chennai  4800.0
31     32      Janani   27         HR   34000           3       Erode  3400.0
32     33      Naveen   30         IT   44000           6      Trichy  4400.0
33     34      Monica   29    Finance   42000           5       Salem  4200.0
34     35       Sekar   36      Sales   53000          10   Bangalore  5300.0
35     36         Uma   25         HR   30000           2     Chennai  3000.0
36     37     Kishore   31         IT   47000           7  Coimbatore  4700.0
37     38       Radha   34    Finance   51000           9     Madurai  5100.0
38     39     Sathish   28      Sales   39000           4       Erode  3900.0
39     40    Pavithra   26         HR   32000           3       Salem  3200.0
40     41      Vinoth   35         IT   58000          11   Bangalore  5800.0
41     42      Chitra   29    Finance   41000           5      Trichy  4100.0
42     43       Manoj   33      Sales   49000           8     Chennai  4900.0
43     44      Sindhu   24         HR   26000           1  Coimbatore  2600.0
44     45     Aravind   37         IT   62000          14   Bangalore  6200.0
45     46     Preethi   28    Finance   38000           4     Madurai  3800.0
46     47  Muthukumar   34      Sales   52000           9       Salem  5200.0
47     48     Shalini   27         HR   35000           3       Erode  3500.0
48     49       Surya   31         IT   46000           6      Trichy  4600.0
49     50      Bhavya   25    Finance   33000           2     Chennai  3300.0

In [54]:
#Employees earning more than department average salary.
df[df["Salary"]>df.groupby("Department")["Salary"].transform("mean")]

    EmpID        Name  Age Department  Salary  Experience       City   Bonus
5       6      Suresh   35         HR   50000          10     Trichy  5000.0
9      10       Vijay   34         IT   55000           9  Bangalore  5500.0
13     14       Kumar   32         IT   48000           7      Salem  4800.0
14     15       Latha   29         HR   36000           5     Trichy  3600.0
15     16       Mohan   33      Sales   46000           8    Chennai  4600.0
17     18    Santhosh   36    Finance   52000          11  Bangalore  5200.0
19     20        Bala   31         HR   43000           6    Chennai  4300.0
21     22     Revathi   34    Finance   50000           9    Madurai  5000.0
24     25       Gokul   35         IT   60000          12  Bangalore  6000.0
26     27     Prakash   32      Sales   47000           7      Salem  4700.0
28     29      Ramesh   38         IT   65000          15  Bangalore  6500.0
30     31   Saravanan   33      Sales   48000           8    Chennai  4800.0
31     32      Janani   27         HR   34000           3      Erode  3400.0
33     34      Monica   29    Finance   42000           5      Salem  4200.0
34     35       Sekar   36      Sales   53000          10  Bangalore  5300.0
37     38       Radha   34    Finance   51000           9    Madurai  5100.0
40     41      Vinoth   35         IT   58000          11  Bangalore  5800.0
41     42      Chitra   29    Finance   41000           5     Trichy  4100.0
42     43       Manoj   33      Sales   49000           8    Chennai  4900.0
44     45     Aravind   37         IT   62000          14  Bangalore  6200.0
46     47  Muthukumar   34      Sales   52000           9      Salem  5200.0
47     48     Shalini   27         HR   35000           3      Erode  3500.0

In [57]:
#Top 5 highest paid employees.
df.sort_values("Salary",ascending=False).head(5)

    EmpID     Name  Age Department  Salary  Experience       City   Bonus
28     29   Ramesh   38         IT   65000          15  Bangalore  6500.0
44     45  Aravind   37         IT   62000          14  Bangalore  6200.0
24     25    Gokul   35         IT   60000          12  Bangalore  6000.0
40     41   Vinoth   35         IT   58000          11  Bangalore  5800.0
9      10    Vijay   34         IT   55000           9  Bangalore  5500.0

In [59]:
#Employees with experience between 5 and 10.
df[df["Experience"].between(5,10)]

    EmpID        Name  Age Department  Salary  Experience        City   Bonus
3       4        Mani   30         IT   45000           6   Bangalore  4500.0
5       6      Suresh   35         HR   50000          10      Trichy  5000.0
7       8        Arun   29    Finance   40000           5     Chennai  4000.0
8       9       Meena   31      Sales   42000           7       Erode  4200.0
9      10       Vijay   34         IT   55000           9   Bangalore  5500.0
13     14       Kumar   32         IT   48000           7       Salem  4800.0
14     15       Latha   29         HR   36000           5      Trichy  3600.0
15     16       Mohan   33      Sales   46000           8     Chennai  4600.0
19     20        Bala   31         HR   43000           6     Chennai  4300.0
21     22     Revathi   34    Finance   50000           9     Madurai  5000.0
22     23       Ajith   29      Sales   41000           5      Trichy  4100.0
26     27     Prakash   32      Sales   47000           7       Salem  4700.0
30     31   Saravanan   33      Sales   48000           8     Chennai  4800.0
32     33      Naveen   30         IT   44000           6      Trichy  4400.0
33     34      Monica   29    Finance   42000           5       Salem  4200.0
34     35       Sekar   36      Sales   53000          10   Bangalore  5300.0
36     37     Kishore   31         IT   47000           7  Coimbatore  4700.0
37     38       Radha   34    Finance   51000           9     Madurai  5100.0
41     42      Chitra   29    Finance   41000           5      Trichy  4100.0
42     43       Manoj   33      Sales   49000           8     Chennai  4900.0
46     47  Muthukumar   34      Sales   52000           9       Salem  5200.0
48     49       Surya   31         IT   46000           6      Trichy  4600.0

In [61]:
#Rename column EmpID to Employee_ID.
df.rename(columns={"EmpID":"Employee_ID"})

,Employee_ID,Name,Age,Department,Salary,Experience,City,Bonus
0,1,Ravi,25,IT,30000,2,Chennai,3000.0
1,2,Karthi,28,HR,28000,3,Coimbatore,2800.0
2,3,Anu,24,Finance,32000,1,Chennai,3200.0
3,4,Mani,30,IT,45000,6,Bangalore,4500.0
4,5,Priya,27,Sales,35000,4,Madurai,3500.0
5,6,Suresh,35,HR,50000,10,Trichy,5000.0
6,7,Divya,26,IT,33000,2,Salem,3300.0
7,8,Arun,29,Finance,40000,5,Chennai,4000.0
8,9,Meena,31,Sales,42000,7,Erode,4200.0
9,10,Vijay,34,IT,55000,9,Bangalore,5500.0
10,11,Nisha,23,HR,25000,1,Chennai,2500.0
11,12,Raj,28,Sales,37000,4,Coimbatore,3700.0
12,13,Pooja,26,Finance,34000,2,Madurai,3400.0
13,14,Kumar,32,IT,48000,7,Salem,4800.0
14,15,Latha,29,HR,36000,5,Trichy,3600.0
15,16,Mohan,33,Sales,46000,8,Chennai,4600.0
16,17,Keerthi,24,IT,31000,1,Erode,3100.0
17,18,Santhosh,36,Finance,52000,11,Bangalore,5200.0
18,19,Aishwarya,27,Sales,38000,3,Salem,3800.0
19,20,Bala,31,HR,43000,6,Chennai,4300.0
20,21,Deepak,28,IT,39000,4,Coimbatore,3900.0
21,22,Revathi,34,Finance,50000,9,Madurai,5000.0
22,23,Ajith,29,Sales,41000,5,Trichy,4100.0
23,24,Sneha,25,HR,29000,2,Erode,2900.0
24,25,Gokul,35,IT,60000,12,Bangalore,6000.0
25,26,Harini,26,Finance,35000,2,Chennai,3500.0
26,27,Prakash,32,Sales,47000,7,Salem,4700.0
27,28,Swetha,24,HR,27000,1,Coimbatore,2700.0
28,29,Ramesh,38,IT,65000,15,Bangalore,6500.0
29,30,Kavya,28,Finance,39000,4,Madurai,3900.0
30,31,Saravanan,33,Sales,48000,8,Chennai,4800.0
31,32,Janani,27,HR,34000,3,Erode,3400.0
32,33,Naveen,30,IT,44000,6,Trichy,4400.0
33,34,Monica,29,Finance,42000,5,Salem,4200.0
34,35,Sekar,36,Sales,53000,10,Bangalore,5300.0
35,36,Uma,25,HR,30000,2,Chennai,3000.0
36,37,Kishore,31,IT,47000,7,Coimbatore,4700.0
37,38,Radha,34,Finance,51000,9,Madurai,5100.0
38,39,Sathish,28,Sales,39000,4,Erode,3900.0
39,40,Pavithra,26,HR,32000,3,Salem,3200.0
40,41,Vinoth,35,IT,58000,11,Bangalore,5800.0
41,42,Chitra,29,Finance,41000,5,Trichy,4100.0
42,43,Manoj,33,Sales,49000,8,Chennai,4900.0
43,44,Sindhu,24,HR,26000,1,Coimbatore,2600.0
44,45,Aravind,37,IT,62000,14,Bangalore,6200.0
45,46,Preethi,28,Finance,38000,4,Madurai,3800.0
46,47,Muthukumar,34,Sales,52000,9,Salem,5200.0
47,48,Shalini,27,HR,35000,3,Erode,3500.0
48,49,Surya,31,IT,46000,6,Trichy,4600.0
49,50,Bhavya,25,Finance,33000,2,Chennai,3300.0

In [62]:
df.drop(columns="City")

    EmpID        Name  Age Department  Salary  Experience   Bonus
0       1        Ravi   25         IT   30000           2  3000.0
1       2      Karthi   28         HR   28000           3  2800.0
2       3         Anu   24    Finance   32000           1  3200.0
3       4        Mani   30         IT   45000           6  4500.0
4       5       Priya   27      Sales   35000           4  3500.0
5       6      Suresh   35         HR   50000          10  5000.0
6       7       Divya   26         IT   33000           2  3300.0
7       8        Arun   29    Finance   40000           5  4000.0
8       9       Meena   31      Sales   42000           7  4200.0
9      10       Vijay   34         IT   55000           9  5500.0
10     11       Nisha   23         HR   25000           1  2500.0
11     12         Raj   28      Sales   37000           4  3700.0
12     13       Pooja   26    Finance   34000           2  3400.0
13     14       Kumar   32         IT   48000           7  4800.0
14     15       Latha   29         HR   36000           5  3600.0
15     16       Mohan   33      Sales   46000           8  4600.0
16     17     Keerthi   24         IT   31000           1  3100.0
17     18    Santhosh   36    Finance   52000          11  5200.0
18     19   Aishwarya   27      Sales   38000           3  3800.0
19     20        Bala   31         HR   43000           6  4300.0
20     21      Deepak   28         IT   39000           4  3900.0
21     22     Revathi   34    Finance   50000           9  5000.0
22     23       Ajith   29      Sales   41000           5  4100.0
23     24       Sneha   25         HR   29000           2  2900.0
24     25       Gokul   35         IT   60000          12  6000.0
25     26      Harini   26    Finance   35000           2  3500.0
26     27     Prakash   32      Sales   47000           7  4700.0
27     28      Swetha   24         HR   27000           1  2700.0
28     29      Ramesh   38         IT   65000          15  6500.0
29     30       Kavya   28    Finance   39000           4  3900.0
30     31   Saravanan   33      Sales   48000           8  4800.0
31     32      Janani   27         HR   34000           3  3400.0
32     33      Naveen   30         IT   44000           6  4400.0
33     34      Monica   29    Finance   42000           5  4200.0
34     35       Sekar   36      Sales   53000          10  5300.0
35     36         Uma   25         HR   30000           2  3000.0
36     37     Kishore   31         IT   47000           7  4700.0
37     38       Radha   34    Finance   51000           9  5100.0
38     39     Sathish   28      Sales   39000           4  3900.0
39     40    Pavithra   26         HR   32000           3  3200.0
40     41      Vinoth   35         IT   58000          11  5800.0
41     42      Chitra   29    Finance   41000           5  4100.0
42     43       Manoj   33      Sales   49000           8  4900.0
43     44      Sindhu   24         HR   26000           1  2600.0
44     45     Aravind   37         IT   62000          14  6200.0
45     46     Preethi   28    Finance   38000           4  3800.0
46     47  Muthukumar   34      Sales   52000           9  5200.0
47     48     Shalini   27         HR   35000           3  3500.0
48     49       Surya   31         IT   46000           6  4600.0
49     50      Bhavya   25    Finance   33000           2  3300.0

In [63]:
#Check for null values.
df.isna()

    EmpID   Name    Age  Department  Salary  Experience   City  Bonus
0   False  False  False       False   False       False  False  False
1   False  False  False       False   False       False  False  False
2   False  False  False       False   False       False  False  False
3   False  False  False       False   False       False  False  False
4   False  False  False       False   False       False  False  False
5   False  False  False       False   False       False  False  False
6   False  False  False       False   False       False  False  False
7   False  False  False       False   False       False  False  False
8   False  False  False       False   False       False  False  False
9   False  False  False       False   False       False  False  False
10  False  False  False       False   False       False  False  False
11  False  False  False       False   False       False  False  False
12  False  False  False       False   False       False  False  False
13  False  False  False       False   False       False  False  False
14  False  False  False       False   False       False  False  False
15  False  False  False       False   False       False  False  False
16  False  False  False       False   False       False  False  False
17  False  False  False       False   False       False  False  False
18  False  False  False       False   False       False  False  False
19  False  False  False       False   False       False  False  False
20  False  False  False       False   False       False  False  False
21  False  False  False       False   False       False  False  False
22  False  False  False       False   False       False  False  False
23  False  False  False       False   False       False  False  False
24  False  False  False       False   False       False  False  False
25  False  False  False       False   False       False  False  False
26  False  False  False       False   False       False  False  False
27  False  False  False       False   False       False  False  False
28  False  False  False       False   False       False  False  False
29  False  False  False       False   False       False  False  False
30  False  False  False       False   False       False  False  False
31  False  False  False       False   False       False  False  False
32  False  False  False       False   False       False  False  False
33  False  False  False       False   False       False  False  False
34  False  False  False       False   False       False  False  False
35  False  False  False       False   False       False  False  False
36  False  False  False       False   False       False  False  False
37  False  False  False       False   False       False  False  False
38  False  False  False       False   False       False  False  False
39  False  False  False       False   False       False  False  False
40  False  False  False       False   False       False  False  False
41  False  False  False       False   False       False  False  False
42  False  False  False       False   False       False  False  False
43  False  False  False       False   False       False  False  False
44  False  False  False       False   False       False  False  False
45  False  False  False       False   False       False  False  False
46  False  False  False       False   False       False  False  False
47  False  False  False       False   False       False  False  False
48  False  False  False       False   False       False  False  False
49  False  False  False       False   False       False  False  False

In [64]:
#Export filtered IT employees to new CSV.
df[df["Department"]=="IT"].to_csv("IT_Employees.csv",index=False)